uhnp/src/InformationRegisters/РазмещениеЗаявок/РазмещениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЗаявок</name>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.АналитикаПланированияКонтрагент</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияБанковскогоСчетаКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРазбиенияСлияния</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВстречнойПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияКурсаПлатежа</name>
    <type>
      <types>EnumRef.СпособыОпределенияКурсаПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииКурсаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигДатыФиксацииКурсаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсУстановленВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыОпределенияКурсаПлатежа/СпособыОпределенияКурсаПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияКурсаПлатежа</name>
  <enumValues>
    <name>ФиксированныйКурс</name>
  </enumValues>
  <enumValues>
    <name>КурсНаДатуПлатежа</name>
  </enumValues>
  <enumValues>
    <name>КурсНаФиксированнуюДату</name>
  </enumValues>
  <enumValues>
    <name>КурсНаДатуОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВЗаявке</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/РазмещениеЗаявок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ОбработчикиОбновления

Процедура ЗаполнитьПараметрыКурсаВРазмещенииЗаявок() Экспорт
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
	|	РазмещениеЗаявок.ПриходРасход КАК ПриходРасход,
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КурсПлатежа КАК КурсПлатежа,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КратностьПлатежа КАК КратностьПлатежа,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.СпособОпределенияКурсаПлатежа КАК СпособОпределенияКурсаПлатежа,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.ДатаФиксацииКурсаПлатежа КАК ДатаФиксацииКурсаПлатежа,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.СдвигДатыФиксацииКурсаПлатежа КАК СдвигДатыФиксацииКурсаПлатежа,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КурсПлатежаНеБолее КАК КурсПлатежаНеБолее,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КурсПлатежаНеМенее КАК КурсПлатежаНеМенее,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КурсПлатежаНеМенееВВалютеОплаты КАК КурсПлатежаНеМенееВВалютеОплаты,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.КурсПлатежаНеБолееВВалютеОплаты КАК КурсПлатежаНеБолееВВалютеОплаты
	|ИЗ
	|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|ГДЕ
	|	РазмещениеЗаявок.СпособОпределенияКурсаПлатежа = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияКурсаПлатежа.ПустаяСсылка)
	|	И РазмещениеЗаявок.ЗаявкаНаОперацию.СпособОпределенияКурсаПлатежа <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияКурсаПлатежа.ПустаяСсылка)";
	
	Запрос = Новый Запрос;
	
	ТекстыПодзапросов = Новый Массив;
	
	ТекстДляЗамены = "РазмещениеЗаявок.ЗаявкаНаОперацию";
	
	ШаблонЗаявка = "ВЫРАЗИТЬ(%1 КАК Документ.%2)";
	ШаблонГде = "
			|	И РазмещениеЗаявок.ЗаявкаНаОперацию ССЫЛКА Документ.%1";
	
	// заявка на оплату
	ПустаяЗаявка = КэшируемыеПроцедурыОПК.ПустаяЗаявкаНаОплату();
	ДокументыЗаявки = Новый Массив;
	ДокументыЗаявки.Добавить(КэшируемыеПроцедурыОПК.ПустаяЗаявкаНаОплату());
	ДокументыЗаявки.Добавить(КэшируемыеПроцедурыОПК.ПустоеПланируемоеПоступление());
	Для Каждого ДокументЗаявка Из ДокументыЗаявки Цикл
		ИмяМетаданных = ДокументЗаявка.Метаданные().Имя;
		ТекстЗамены = СтрШаблон(ШаблонЗаявка, ТекстДляЗамены, ИмяМетаданных);
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, ТекстДляЗамены, ТекстЗамены)
					 + СтрШаблон(ШаблонГде, ИмяМетаданных);
		ТекстыПодзапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстОбъекдинения = 
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыПодзапросов, ТекстОбъекдинения);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.РазмещениеЗаявок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаНаОперацию.Установить(Выборка.ЗаявкаНаОперацию);
		НаборЗаписей.Отбор.ПриходРасход.Установить(Выборка.ПриходРасход);
		НаборЗаписей.Отбор.ИдентификаторПозиции.Установить(Выборка.ИдентификаторПозиции);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Позиция = НаборЗаписей[0];
		Позиция.СпособОпределенияКурсаПлатежа = Выборка.СпособОпределенияКурсаПлатежа;
		Если Позиция.СпособОпределенияКурсаПлатежа = Перечисления.СпособыОпределенияКурсаПлатежа.ФиксированныйКурс
			И Позиция.КурсПлатежа = 0 Тогда
			Позиция.КурсПлатежа = Выборка.КурсПлатежа;
			Позиция.КратностьПлатежа = Выборка.КратностьПлатежа;
		КонецЕсли;
		Позиция.ДатаФиксацииКурсаПлатежа = Выборка.ДатаФиксацииКурсаПлатежа;
		Позиция.СдвигДатыФиксацииКурсаПлатежа = Выборка.СдвигДатыФиксацииКурсаПлатежа;
		Позиция.КурсПлатежаНеБолее = Выборка.КурсПлатежаНеБолее;
		Позиция.КурсПлатежаНеМенее = Выборка.КурсПлатежаНеМенее;
		Позиция.КурсПлатежаНеМенееВВалютеОплаты = Выборка.КурсПлатежаНеМенееВВалютеОплаты;
		Позиция.КурсПлатежаНеБолееВВалютеОплаты = Выборка.КурсПлатежаНеБолееВВалютеОплаты;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
